BlakeStrebel/2R-Robots/BackupAndUI/TM4C Examples/MATLAB/realTimeSpeedTest.c
//*****************************************************************************
// uart_echo.c
//
// Benjamen Lim
//
// This example shows how to echo back charcters using the UART
//
// It increments the characters by 1 to show that they have been changed
//
// Use none for flow control and parity, 115200 for the baud rate, 8-n-1 mode
//
// This example uses the ROM_ prefix, which calls the TivaWare firmware in the
// ROM, which should make the program a little faster.
//
//*****************************************************************************

#define TARGET_IS_TM4C123_RB2
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "driverlib/debug.h"
#include "driverlib/fpu.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/pin_map.h"
#include "driverlib/rom.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"

//Test 2/4/2018
float f = 2.343434;
float data[2][2] = {{1.1,2.2},{3.3,4.4}};
char s1[15];
uint8_t *array;
uint8_t x;
#define RED_LED   GPIO_PIN_1
#define BLUE_LED  GPIO_PIN_2
#define GREEN_LED GPIO_PIN_3

//Test 2/7/2018
float bigdata[4000];
int i;

//*****************************************************************************
//
// The error routine that is called if the driver library encounters an error.
//
//*****************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
}
#endif


//*****************************************************************************
//
// Send a string to the UART.
//
//*****************************************************************************
void
UARTSend(const uint8_t *pui8Buffer, uint32_t ui32Count)
{
    //
    // Loop while there are more characters to send.
    //
    while(ui32Count--)
    {
        //
        // Write the next character to the UART.
        //
        ROM_UARTCharPut(UART0_BASE, *pui8Buffer++);
    }
}

//*****************************************************************************
//
// The UART interrupt handler.
//
// Note that the UART interrupt handler requires a definition in startup_ccs.c
//
//*****************************************************************************

void UARTSend(const uint8_t *pui8Buffer, uint32_t ui32Count);


void
UARTIntHandler(void)
{
    uint32_t ui32Status;

    //
    // Get the interrrupt status.
    //
    ui32Status = ROM_UARTIntStatus(UART0_BASE, true);

    //
    // Clear the asserted interrupts.
    // We need to clear the flag otherwise it will not interrupt again
    ROM_UARTIntClear(UART0_BASE, ui32Status);

    //
    // Loop while there are characters in the receive FIFO.
    //
    char charBuf[4]; // create an array to hold our float
    int count = 0;
    while(ROM_UARTCharsAvail(UART0_BASE))
    {
        //
        // Read the next character from the UART and write it back to the UART.
        //
        

        char newchar = ROM_UARTCharGetNonBlocking(UART0_BASE);
        charBuf[count] = newchar;
        count++;

        // adding one changes the letter, so you know that the value is incremented.
        //ROM_UARTCharPutNonBlocking(UART0_BASE,newchar+1);
        //char replyString[25]={};
        //sprintf(replyString,"Hello! You sent: %c\r\n",newchar);

        // Speed test 2/18/2018
        

        // Test 2/7/2018
        // array = &bigdata;
        // UARTSend(array,(i) * 4);

        //Test 2/4/2018
        //array = &f;
        //array = data;
        //UARTSend(array,16);
        //UARTSend((uint8_t *) "R2R WelcomeHAHAHAHAHAHAHHHAHAHHHAHAHAHHAHAHAHAHAHAHAHAHAHHA \r\n",200);
        //Test 2/4/2018
        //UARTSend(array,15);



        // Another option that is blocking is:
        // UARTCharPut(UART0_BASE, 'r');


        //
        // Blink the LED to show a character transfer is occuring.
        //
        // GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_2, GPIO_PIN_2);

        //
        // Delay for 1 millisecond.  Each SysCtlDelay is about 3 clocks.
        //
        // SysCtlDelay(SysCtlClockGet() / (1000 * 3));

        //
        // Turn off the LED
        //
        // GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_2, 0);

    }
    float recv = *(float *)&charBuf; // convert a char array to a float
    float valRecv = recv*2.0; // do some operation on the float
    UARTSend(valRecv, (i)*4); // send it back.

}




int
main(void)
{

    //Test 2/7/2018
    for (i = 0; i < 4000; i++)
        bigdata[i] = 1.23456;



    //Test 2/4/2018

    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
    GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, RED_LED|BLUE_LED|GREEN_LED);
    if (sizeof(f) == 4 * sizeof(x))
        GPIOPinWrite(GPIO_PORTF_BASE, RED_LED|BLUE_LED|GREEN_LED, GREEN_LED);


    //array = (uint8_t *)(&f);
    //sprintf(s1, "%f", f);


    //
    // Enable lazy stacking for interrupt handlers.  This allows floating-point
    // instructions to be used within interrupt handlers, but at the expense of
    // extra stack usage.
    //
    // This is not necessary and can be removed.
    // ROM_FPUEnable();
    // ROM_FPULazyStackingEnable();

    //
    // Use PLL to set our time, and lock it to the external crystal (defined as 16Mhz)
    // PLL generates a 200Mhz clock no matter the input clock
    // Divide by 4 to get a final clock of 50Mhz
    ROM_SysCtlClockSet(SYSCTL_SYSDIV_4 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN |
                       SYSCTL_XTAL_16MHZ);

    //
    // Enable the GPIO port that is used for the on-board LED.
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);

    //
    // Enable the GPIO pins for the LED (PF2).
    //
    ROM_GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_2);

    //
    // Enable the peripherals used by this example.
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);

    //
    // Enable processor interrupts.
    //
    ROM_IntMasterEnable();

    //
    // Set GPIO A0 and A1 as UART pins.
    //
    GPIOPinConfigure(GPIO_PA0_U0RX);
    GPIOPinConfigure(GPIO_PA1_U0TX);
    ROM_GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);

    //
    // Configure the UART for 128,000, 8-N-1 operation.
    //
    ROM_UARTConfigSetExpClk(UART0_BASE, ROM_SysCtlClockGet(), 128000,
                            (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE |
                             UART_CONFIG_PAR_NONE));

    //
    // Enable the UART interrupt.
    //
    ROM_IntEnable(INT_UART0);
    ROM_UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);

    //
    // Prompt for text to be entered.
    //
    UARTSend((uint8_t *)"\033[2JEnter text: ", 16);

    //
    // Loop forever echoing data through the UART.
    //
    while(1)
    {
    }
}
